export const errorMessages = {
    // Повідомлення для користувача
    empty_name: "Ім'я не може бути порожнім",
    invalid_name_format: "Некоректний формат імені для обраної мови",
    empty_date: "Дата не може бути порожньою",
    invalid_date_format: "Неправильний формат дати. Використовуйте ДД.ММ.РРРР",
    invalid_date_value: "Невірна дата. Перевірте правильність введених даних",
    access_denied: "Доступ заборонено",

    // Повідомлення для логування
    scene_init_error: "Помилка при ініціалізації сцени:",
    language_selection_error: "Помилка при виборі мови:",
    name_input_error: "Помилка при введенні імені:",
    date_input_error: "Помилка при введенні дати:",
    confirmation_error: "Помилка при підтвердженні:",
    cancel_error: "Помилка при скасуванні:",
    calculation_error: "Помилка при розрахунку:",
    bot_start_error: "Помилка при запуску бота:",
    bot_stop_error: "Помилка при зупинці бота:"
};

export const messages = {
    choose_language: "🌍 Оберіть мову для імені:",
    access_denied: "❌ Доступ заборонено. Ви не в списку дозволених користувачів.",
    language_ua: "Українська 🇺🇦",
    language_en: "Англійська 🇬🇧",
    enter_name_single: "✏️ Введіть ім'я обраною мовою:",
    enter_birthdate: "📆 Введіть дату народження (ДД.ММ.РРРР):",
    invalid_name: "❌ Некоректний формат імені для обраної мови!",
    invalid_format: "❌ *Неправильний формат!*\nВведіть у форматі `ДД.ММ.РРРР` (наприклад, 31.12.2000)",
    invalid_date: "❌ *Невірна дата!*\nПеревірте `ДД.ММ.РРРР` (день.місяць.рік) і спробуйте знову.",
    try_again_or_cancel: "Спробуйте ще раз або скасуйте:",
    invalid_language: "❌ Будь ласка, оберіть мову з клавіатури!",
    confirm_data: "🔍 Перевірте дані:",
    result_title: "🔮 Результат розрахунку:",
    cancel: "Скасувати ❌",
    calculate: "Розрахувати ✅",
    confirm: "Підтвердити ✅",
    canceled: "🚫 Операцію скасовано. /start — почати знову",
    error: "⛔️ Сталася помилка. Спробуйте /start",
    reset_data: "🔄 Всі дані скинуті! Використовуйте /start для початку.",
    end_calculation: "🔄 Розрахунки завершено. Щоб почати знову натисніть /start щоб скинути дані"
};
