export const messages = {
    choose_language: "🌍 Оберіть мову для імені:",
    access_denied: "❌ Доступ заборонено. Ви не в списку дозволених користувачів.",
    language_ua: "Українська 🇺🇦",
    language_en: "Англійська 🇬🇧",
    enter_name_single: "✏️ Введіть ім'я обраною мовою:",
    enter_birthdate: "📆 Введіть дату народження (ДД.ММ.РРРР):",
    invalid_name: "❌ Некоректний формат імені для обраної мови!",
    invalid_format: "❌ *Неправильний формат!*\nВведіть у форматі `ДД.ММ.РРРР` (наприклад, 31.12.2000)",
    invalid_date: "❌ *Невірна дата!*\nПеревірте `ДД.ММ.РРРР` (день.місяць.рік) і спробуйте знову.",
    try_again_or_cancel: "Спробуйте ще раз або скасуйте:",
    invalid_language: "❌ Будь ласка, оберіть мову з клавіатури!",
    confirm_data: "🔍 Перевірте дані:",
    result_title: "🔮 Результат розрахунку:",
    cancel: "Скасувати ❌",
    calculate: "Розрахувати ✅",
    confirm: "Підтвердити ✅",
    canceled: "🚫 Операцію скасовано. /start — почати знову",
    error: "⛔️ Сталася помилка. Спробуйте /start",
    reset_data: "🔄 Всі дані скинуті! Використовуйте /start для початку.",
    end_calculation: "🔄 Розрахунки завершено. Щоб почати знову натисніть /start щоб скинути дані",
};

// Регулярні вирази для валідації
export const NAME_REGEX = {
    ua: /^[а-яґєіїщьюяА-ЯҐЄІЇЩЬЮЯІЄЇҐ ]{2,}$/,
    en: /^[a-zA-Z ]{2,}$/,
};

export const DATE_FORMAT_REGEX = /^\d{2}\.\d{2}\.\d{4}$/; // Формат ДД.ММ.РРРР
